src/Documents/УстановкаЛимитовБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЛимитовБюджета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БюджетыПоКатегориям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛимита</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/БюджетыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БюджетыПоКатегориям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаЛимита</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/УстановкаЛимитовБюджета/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.БюджетыПоКатегориям.Записывать = Истина;
	Движения.БюджетыПоКатегориям.Очистить();
	
	Для Каждого ТекСтрокаЛимиты Из Лимиты Цикл
		Движение = Движения.БюджетыПоКатегориям.Добавить();
		Движение.Период = НачалоМесяца(Дата);
		Движение.СтатьяРасхода = ТекСтрокаЛимиты.СтатьяРасходов;
		Движение.СуммаЛимита = ТекСтрокаЛимиты.СуммаЛимита;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
